Ran Plan for 5 projects:

1. project: `bootstrap-prod` dir: `terraform/bootstrap` workspace: `default`
1. project: `rds-prod` dir: `terraform/rds` workspace: `default`
1. project: `logging-prod` dir: `terraform/logging` workspace: `default`
1. project: `acm-prod` dir: `terraform/acm` workspace: `default`
1. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
---

### 1. project: `bootstrap-prod` dir: `terraform/bootstrap` workspace: `default`
**Plan Error**
```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/67/default/terraform/bootstrap/bootstrap-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/67/default/terraform/bootstrap": exit status 1
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

```

---
### 2. project: `rds-prod` dir: `terraform/rds` workspace: `default`
**Plan Error**
```
dir "terraform/rds" does not exist
```

---
### 3. project: `logging-prod` dir: `terraform/logging` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false -upgrade" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/67/default/terraform/logging": exit status 1

Initializing the backend...
Upgrading modules...
- atlantis_application_logs in ../modules/cloudwatch-log-group
- atlantis_error_logs in ../modules/cloudwatch-log-group
- secrets_rotation_logs in ../modules/cloudwatch-log-group
╷
│ Error: Failed to get existing workspaces: Unable to list objects in S3 bucket "terraform-state-bucket" with prefix "env:/": operation error S3: ListObjectsV2, https response error StatusCode: 301, RequestID: JZVA20QBWZFY9ZN3, HostID: x+CLGhSvRr9fnKzFrJPgXHNL7bRaA4KVIxRrFrisyMt/NOrOxJudpb/NScssFP6mGMhQMpFZ7SOF9p+s9uhavAOTdFlRUzx/, requested bucket from "ap-northeast-2", actual location "us-east-1"
│ 
│ 
╵


```
</details>

---
### 4. project: `acm-prod` dir: `terraform/acm` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/67/default/terraform/acm/acm-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/67/default/terraform/acm": exit status 1
data.aws_route53_zone.primary: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.wildcard will be created
  + resource "aws_acm_certificate" "wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "set-of.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.set-of.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "set-of.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.set-of.com",
          + "set-of.com",
        ]
      + tags                      = {
          + "Component"   = "acm"
          + "CostCenter"  = "infrastructure"
          + "Domain"      = "set-of.com"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "acm-wildcard-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
          + "Type"        = "wildcard"
        }
      + tags_all                  = {
          + "Component"   = "acm"
          + "CostCenter"  = "infrastructure"
          + "Domain"      = "set-of.com"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "acm-wildcard-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
          + "Type"        = "wildcard"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_cloudwatch_metric_alarm.certificate-expiration[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "certificate-expiration" {
      + actions_enabled                       = true
      + alarm_description                     = "ACM certificate for set-of.com is expiring in less than 30 days"
      + alarm_name                            = "acm-certificate-expiration-set-of.com"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "days-to-expiry"
      + namespace                             = "AWS/CertificateManager"
      + period                                = 86400
      + statistic                             = "Minimum"
      + tags                                  = {
          + "Component"   = "monitoring"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "alarm-acm-expiration-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
        }
      + tags_all                              = {
          + "Component"   = "monitoring"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "alarm-acm-expiration-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
        }
      + threshold                             = 30
      + treat_missing_data                    = "notBreaching"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + certificate_arn                       = (known after apply)
  + certificate_domain_name               = "set-of.com"
  + certificate_id                        = (known after apply)
  + certificate_not_after                 = (known after apply)
  + certificate_not_before                = (known after apply)
  + certificate_status                    = (known after apply)
  + certificate_subject_alternative_names = [
      + "*.set-of.com",
      + "set-of.com",
    ]
  + certificate_validation_method         = "DNS"
  + expiration_alarm_arn                  = (known after apply)
╷
│ Error: reading Route 53 Hosted Zones: operation error Route 53: ListHostedZones, https response error StatusCode: 403, RequestID: 95d3d6a7-9cf1-4fe0-9913-502bb90d7404, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/8a4c791b5aa64e46b51324c99db77545 is not authorized to perform: route53:ListHostedZones because no identity-based policy allows the route53:ListHostedZones action
│ 
│   with data.aws_route53_zone.primary,
│   on main.tf line 106, in data "aws_route53_zone" "primary":
│  106: data "aws_route53_zone" "primary" {
│ 
╵

```
</details>

---
### 5. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_ecr_repository.fileflow will be updated in-place
~ resource "aws_ecr_repository" "fileflow" {
        id                   = "fileflow"
        name                 = "fileflow"
      ~ tags                 = {
            "Component"   = "container-registry"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "Name"        = "ecr-fileflow"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Service"     = "fileflow"
        }
      ~ tags_all             = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ssm_parameter.fileflow-repository-url will be updated in-place
~ resource "aws_ssm_parameter" "fileflow-repository-url" {
        id              = "/shared/ecr/fileflow-repository-url"
        name            = "/shared/ecr/fileflow-repository-url"
      ~ tags            = {
            "Component"   = "ecr"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "Name"        = "fileflow-ecr-repository-url-export"
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            "Service"     = "fileflow"
        }
      ~ tags_all        = {
          ~ "Owner"       = "platform-team@ryuqqq.com" -> "fbtkdals2@naver.com"
            # (9 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p ecr-fileflow-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Fecr%252Ffileflow%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p ecr-fileflow-prod
  ```
Plan: 0 to add, 2 to change, 0 to destroy.

---
### Plan Summary

5 projects, 1 with changes, 0 with no changes, 4 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```